Data/SimulationFiles/K35_Re5250/system/sample
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7  
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
type            sets;
#include "$FOAM_CASE/config"
libs            ("libsampling.so");

writeControl    writeTime;
interpolationScheme cellPoint;
setFormat       csv;



sets
(
    center_y
    {
        type    lineUniform;
        axis    y;
        start   (0 0 0);
        end     (0 $sigma 0);
        nPoints 200;
    }
    
);

fields          (U k nut);
// ************************************************************************* //
